#+SETUPFILE: base-template.org
#+TITLE:     Travaux Pratiques #1
#+SUBTITLE:     Algo & Prog avec R
#+PROPERTY: header-args :results output :exports none
#+BEGIN_abstract
Cette séance de travaux pratiques doit être réalisée en distanciel.
#+END_abstract
** Expressions arithmétiques
  Quelle est la valeur de chacune des expressions suivantes :
#+BEGIN_SRC R :exports code
  4 %/% 5 * 3 + 5 %/% 3 
  4 %/% 5 * (3 + 5) %/% 3
#+END_SRC

#+RESULTS:
: [1] 1
: [1] 0

   N.B. Il est de bonne pratique de laisser un espace de part et d'autre d'un opérateur : il est plus facile de lire ~2 – x // y~ que ~2-x%/%y~ \dots
   
   1. Si ~n~ est un entier écrit en décimal, que représentent au niveau des chiffres les opérations ~n %/% 10~ et ~n %% 10~ ?
   2. Quelle opération permet de savoir si un entier ~n~ est un multiple d'un entier ~d~ ?
   3. Quelle opération arithmétique permet de savoir si un entier ~n~ est pair ? 
   4. Demandez en une ligne si 5^4 est plus grand que 4^5.
   5. Calculez la moyenne des entiers de 1 à 10. Le résultat est un nombre flottant (à virgule).
   6. Calculez la moyenne des entiers de 1 à 11. Ne retapez pas la formule complète, mais modifiez la précédente en tapant la flèche haut qui va chercher les lignes précédemment entrées (ce que les programmeurs nomment l'historique). On utilise la flèche bas en sens inverse.
   7. Vérifiez que les règles de calcul sur l'infini sont à peu près respectées.


#+BEGIN_SRC R 
  n <- 1234
  paste("n =",n)
  paste(n %% 10, "represente le chiffre des unites de", n,"en base 10 (decimal)")
  paste(n %% 2, "represente le chiffre des unites de", n,"en base 2 (binaire)")
  paste(n %/% 10, "represente le nombre obtenu en gommant le chiffre des unites en base 10 (decalage a droite)")
  paste(n %/% 2, "represente le nombre obtenu en gommant le chiffre des unites en base 2 (decalage a droite)")
  paste(n,'est multiple de 3 :',n%%3==0)
  paste(n,'est multiple de 2 :',n%%2==0)
  paste('5 ** 4 > 4 ** 5 :',5 ** 4 > 4 ** 5)
  paste('Moyenne des entiers de [1,10] :',(1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10) / 10)
#+END_SRC

#+RESULTS:
: [1] "n = 1234"
: [1] "4 represente le chiffre des unites de 1234 en base 10 (decimal)"
: [1] "0 represente le chiffre des unites de 1234 en base 2 (binaire)"
: [1] "123 represente le nombre obtenu en gommant le chiffre des unites en base 10 (decalage a droite)"
: [1] "617 represente le nombre obtenu en gommant le chiffre des unites en base 2 (decalage a droite)"
: [1] "1234 est multiple de 3 : FALSE"
: [1] "1234 est multiple de 2 : TRUE"
: [1] "5 ** 4 > 4 ** 5 : FALSE"
: [1] "Moyenne des entiers de [1,10] : 5.5"



#+BEGIN_SRC R :exports code
  paste('3 * Inf =',3 * Inf)
  paste('-2 * Inf =',-2 * Inf)
  paste('1 / 0 =',1/0)
  ## NaN signifie "Not A Number", forme indeterminee.
  paste('Inf / Inf =',Inf/ Inf)      
  paste('Inf / Inf =',Inf/ Inf)      
  paste('0 / 0 =',0 / 0)    
#+END_SRC

#+RESULTS:
: [1] "3 * Inf = Inf"
: [1] "-2 * Inf = -Inf"
: [1] "1 / 0 = Inf"
: [1] "Inf / Inf = NaN"
: [1] "Inf / Inf = NaN"
: [1] "0 / 0 = NaN"
